

collection.push({
	name: 'ArrayList',
	desc: ['Список реализованный на основе массива, все элементы в нем отсортированы в порядке добавления. Доступ к элементам происходит по индексу, нумерация начинается с 0. В отличии от Set может содержать дубликаты и null. При создании может быть проинициализирован начальным размером capacity (по умолчанию capacity = 10) , в процессе размер растет динамически.'],
	javadoc: 'https://docs.oracle.com/javase/9/docs/api/java/util/ArrayList.html',
	methods: []
})

